# 1. Вивести кількість палат, місткість яких більша за 10.
select count(*) from wards where places > 3;
# 2. Вивести назви корпусів та кількість палат у кожному з них.
select departments.name,count(*) from departments
join wards w on departments.id_departments = w.department_id
group by departments.name;
# 3. Вивести назви відділень та кількість палат у кожному з них.
select departments.name,count(*) from departments
                                          join wards w on departments.id_departments = w.department_id
group by departments.name;
# 4. Вивести назви відділень та сумарну надбавку лікарів у
# кожному з них.


# 5. Вивести назви відділень, у яких проводять обстеження 5
# та більше лікарів.
# 6. Вивести кількість лікарів та їх сумарну зарплату (сума
# ставки та надбавки).
# 7. Вивести середню зарплату (сума ставки та надбавки) лікарів.
# 8. Вивести назви палат із мінімальною місткістю.
# 9. Вивести в яких із корпусів 1, 6, 7 та 8, сумарна кількість
# місць у палатах перевищує 100. При цьому враховувати
# лише палати з кількістю місць більше 10.